БухЭксп/InformationRegisters/ИдентификаторыПлатежныхСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыПлатежныхСистем</Name>
			<Comment>Идентификатор</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оплата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОперации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлатежнаяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДействияСсылки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиПодключенияКПлатежнымСистемам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапросаСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассоваяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтложенноеПолучениеСтатуса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументОперации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументОперацииПлатежнойСистемы</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/CommonModules/ПлатежныеСистемы/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ПлатежныеСистемы.БазоваяФункциональностьПлатежныхСистем".
// ОбщийМодуль.ПлатежныеСистемы.
// 
// Серверные процедуры взаимодействия с платежными системами:
//  - проверка доступности использования функциональности подсистемы;
//  - создание запроса на возврат оплаты по оплаченным заказам;
//  - установка отложенного получения статуса;
//  - проверка статуса операций;
//  - получение данных операции;
//  - удаление операции.
//
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ПроверкаДоступности

// Определяет доступность использования функциональности подключения к платежным системам на основании прав доступа
// пользователя.
//
// Возвращаемое значение:
//  Булево - если Истина, настройка подключения к платежным системам доступна.
//
Функция НастройкаПодключенияДоступна() Экспорт
	
	Возврат ПравоДоступа("Изменение", Метаданные.Справочники.НастройкиПодключенияКПлатежнымСистемам)
		И ПравоДоступа("Добавление", Метаданные.Справочники.НастройкиПодключенияКПлатежнымСистемам);
	
КонецФункции

// Определяет доступность использования функциональности выполнения операций на основании прав доступа пользователя.
//
// Возвращаемое значение:
//  Булево - если Истина, выполнение операций с платежными системами доступно.
//
Функция ОперацииДоступны() Экспорт
	
	Возврат ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ИдентификаторыПлатежныхСистем)
		И ПравоДоступа("Чтение", Метаданные.Справочники.НастройкиПодключенияКПлатежнымСистемам);
	
КонецФункции

#КонецОбласти

#Область ПрикладныеОперации

#Область КассовыеСсылки

// Создает запрос на совершение оплаты и активирует QR-код продавца для приема оплаты на заданную сумму.
// Если Платежная система не поддерживает работу с кассовыми ссылками, то возвращается ошибка с кодом
// НеверныйФорматЗапроса.
// Ссылка читается успешно активированной, если КодОшибки содержит пустую строку.
// Метод может быть вызван в тестовом режиме для тестирования активации кассовой ссылки и получения URL-адреса.
// В этом случае параметр ДокументОперации можно не указывать, а результат операции деактивации ссылки заносится
// в свойство РезультатДеактивации.
// 
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к
//    платежному сервису.
//  ПараметрыКассовойСсылки - Структура - параметры ссылки, которую нужно активировать:
//    * КлючСсылки - Строка - ключ кассовой ссылки.
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы -документ, который отражает операцию оплаты
//                     в информационной базе.
//  ДополнительныеПараметры - Произвольный - дополнительные настройки формирования заказа на оплату.
// 
// Возвращаемое значение:
//  Структура - результат создания запроса на возврат оплаты в платежной системе:
//    * КодОшибки - Строка - строковый код возникшей ошибки.
//        Возможные значения:
//          "" - активация кассовой ссылки выполнена успешно.
//          "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения.
//          "НеверныйЛогинИлиПароль" - неверный логин или пароль или параметры подключения к платежной системе.
//          "ОтсутствуетДоступКСервису" - недостаточно прав для выполнения запроса.
//          "ПревышеноКоличествоПопыток" - превышено количество попыток обращения к сервису с некорректным логином и
//            паролем.
//          "СервисВременноНеДоступен" - сервер временно не имеет возможности обрабатывать запросы.
//          "ОшибкаСервиса" - внутренняя ошибка сервиса.
//          "ОшибкаПодключения" - ошибка работы сети Интернет.
//          "НеизвестнаяОшибка" - при получении информации возникла неизвестная (не обрабатываемая) ошибка.
//          "ИнтеграцияНеИспользуется" - настройка подключения неактивна.
//          "ОперацияВыполнена" - ошибка создания нового заказа на возврат оплаты.
//    * СообщениеОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//    * ПлатежнаяСсылка - Строка - адрес страницы по которой выполняется оплата. Можно преобразовать в QR-код
//        и отобразить на экране, если есть проблемы со считыванием физической таблички с кодом.
//    * ИдентификаторОперации - Строка - идентификатор заказа на оплату в платежной системе
//
Функция АктивироватьКассовуюСсылку(
		НастройкаПодключения,
		ПараметрыКассовойСсылки,
		ДокументОперации,
		ДополнительныеПараметры = Неопределено) Экспорт

	// Проверка входных параметров
	ИмяФункции = "ПлатежныеСистемы.АктивироватьКассовуюСсылку";
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"НастройкаПодключения",
		НастройкаПодключения,
		Тип("СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам"));
	
	Возврат ПлатежныеСистемыСлужебный.АктивироватьКассовуюСсылку(
		НастройкаПодключения,
		ПараметрыКассовойСсылки,
		ДокументОперации,
		ДополнительныеПараметры);
	
КонецФункции

// Вызывает метод принудительной деактивации кассовой ссылки. Метод может быть вызван независимо от текущего
// состояния ссылки: для ранее деактивированной ссылки будет возвращен успешный результат.
// Если Платежная система не поддерживает работу с кассовыми ссылками, то возвращается ошибка с кодом
// НеверныйФорматЗапроса.
// Считается, что кассовая ссылка успешно отключена, если КодОшибки содержит пустую строку.
// 
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к
//    платежному сервису.
//  ПараметрыКассовойСсылки - Структура - параметры ссылки, которую нужно активировать:
//    * КлючСсылки - Строка - ключ кассовой ссылки. Обязателен для заполнения.
//    * ИдентификаторОперации - Строка - идентификатор заказа на оплату. Может быть не заполнен.
// 
// Возвращаемое значение:
//  Структура - результат создания запроса на возврат оплаты в платежной системе:
//    * КодОшибки - Строка - строковый код возникшей ошибки.
//        Возможные значения:
//          "" - деактивация кассовой ссылки выполнена успешно.
//          "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения.
//          "НеверныйЛогинИлиПароль" - неверный логин или пароль или параметры подключения к платежной системе.
//          "ОтсутствуетДоступКСервису" - недостаточно прав для выполнения запроса.
//          "ПревышеноКоличествоПопыток" - превышено количество попыток обращения к сервису с некорректным логином и
//            паролем.
//          "СервисВременноНеДоступен" - сервер временно не имеет возможности обрабатывать запросы.
//          "ОшибкаСервиса" - внутренняя ошибка сервиса.
//          "ОшибкаПодключения" - ошибка работы сети Интернет.
//          "НеизвестнаяОшибка" - при получении информации возникла неизвестная (не обрабатываемая) ошибка.
//          "ИнтеграцияНеИспользуется" - настройка подключения неактивна.
//          "ОперацияВыполнена" - ошибка создания нового заказа на возврат оплаты.
//    * СообщениеОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция ДеактивироватьКассовуюСсылку(
		НастройкаПодключения,
		ПараметрыКассовойСсылки) Экспорт

	// Проверка входных параметров
	ИмяФункции = "ПлатежныеСистемы.ДеактивироватьКассовуюСсылку";
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"НастройкаПодключения",
		НастройкаПодключения,
		Тип("СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам"));
	
	Эталон = Новый Структура("КлючСсылки", Неопределено);
	ЗаполнитьЗначенияСвойств(Эталон, ПараметрыКассовойСсылки);
	
	Если Не ЗначениеЗаполнено(Эталон.КлючСсылки) Тогда
		ВызватьИсключение НСтр("ru = 'Не указана кассовая ссылка для деактивации'");
	КонецЕсли;
	
	Возврат ПлатежныеСистемыСлужебный.ДеактивироватьКассовуюСсылку(
		НастройкаПодключения,
		ПараметрыКассовойСсылки);

КонецФункции

// Конструктор параметра ПараметрыКассовойСсылки для методов АктивироватьКассовуюСсылку и 
// ДеактивироватьКассовуюСсылку.
// 
// Параметры:
//  КлючСсылки - Строка - ключ кассовой ссылки.
//  
// Возвращаемое значение:
//  Структура - параметры ссылки, которую нужно активировать:
//    * КлючСсылки - Строка - ключ кассовой ссылки.
//
Функция НовыйПараметрыКассовойСсылки(КлючСсылки = "") Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КлючСсылки", КлючСсылки);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ДинамическиеСсылки

// Создает новый заказ на оплату и получает идентификатор оплаты для формирования QR-кода.
// Если Платежная система не предусматривает возможности прямого создания платежных ссылок,
// то возвращается ошибка с кодом НеверныйФорматЗапроса.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ,
//    который отражает оплату в информационной базе.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам -
//    настройка выполнения операции.
//  ДополнительныеПараметры - Структура, Неопределено - дополнительные настройки формирования
//    заказа на оплату.
//
// Возвращаемое значение:
//  Структура - результат создания динамической ссылки в Системе быстрых платежей:
//    * ПлатежнаяСсылка - Строка - идентификатор, по которому выполняется оплата.
//    * ИдентификаторОперации - Строка - идентификатор заказа на оплату в платежной системе
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//        <Пустая строка> - создание нового заказа выполнено успешно;
//        "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        "УжеОплачен" - документ уже оплачен;
//        "НеверныйЛогинИлиПароль" - неверный логин или пароль или параметры
//          подключения к участнику СБП;
//        "ТребуетсяОплата" - требуется оплата сервиса;
//        "ОтсутствуетДоступКСервису" - у пользователя нет доступа к сервису;
//        "ПревышеноКоличествоПопыток" - превышено количество попыток
//          обращения к сервису с некорректным логином и паролем;
//        "ОшибкаПодключения" - ошибка при подключении к сервису;
//        "ОшибкаСервиса" - внутренняя ошибка сервиса;
//        "НеизвестнаяОшибка" - при получении информации возникла
//          неизвестная (не обрабатываемая) ошибка;
//        "СервисВременноНеДоступен" - на сервере ведутся регламентные работы;
//        "ИнтеграцияНеИспользуется" - использование отключено в настройках.
//        "ОперацияВыполнена" - уже выполнена операция оплаты по указанному документу.
//        "ОперацияВыполняется" - по указанному документу есть операция с другими параметрами.
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция ДинамическаяСсылка(
		ДокументОперации,
		НастройкаПодключения,
		ДополнительныеПараметры = Неопределено) Экспорт
	
	// Проверка входных параметров
	ИмяФункции = "ПлатежныеСистемы.ДинамическаяСсылка";
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ДокументОперации",
		ДокументОперации,
		Метаданные.ОпределяемыеТипы.ДокументОперацииПлатежнойСистемы.Тип);
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"НастройкаПодключения",
		НастройкаПодключения,
		Тип("СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам"));
	
	Возврат ПлатежныеСистемыСлужебный.ДинамическаяСсылка(
		ДокументОперации,
		НастройкаПодключения,
		ДополнительныеПараметры);
	
КонецФункции

// Вызывает метод принудительной отмены динамической ссылки. Метод может быть вызван независимо от текущего
// состояния ссылки: для ранее отмененной ссылки будет возвращен успешный результат.
// Если Платежная система не предусматривает возможности прямой работы с платежными ссылками,
// то возвращается ошибка с кодом НеверныйФорматЗапроса.
// Считается, что платежная ссылка успешно отключена, если КодОшибки содержит пустую строку.
// 
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ,
//    который отражает оплату в информационной базе.
// 
// Возвращаемое значение:
//  Структура - результат создания запроса на возврат оплаты в платежной системе:
//    * КодОшибки - Строка - строковый код возникшей ошибки.
//        Возможные значения:
//          "" - деактивация кассовой ссылки выполнена успешно.
//          "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения.
//          "НеверныйЛогинИлиПароль" - неверный логин или пароль или параметры подключения к платежной системе.
//          "ОтсутствуетДоступКСервису" - недостаточно прав для выполнения запроса.
//          "ПревышеноКоличествоПопыток" - превышено количество попыток обращения к сервису с некорректным логином и
//            паролем.
//          "СервисВременноНеДоступен" - сервер временно не имеет возможности обрабатывать запросы.
//          "ОшибкаСервиса" - внутренняя ошибка сервиса.
//          "ОшибкаПодключения" - ошибка работы сети Интернет.
//          "НеизвестнаяОшибка" - при получении информации возникла неизвестная (не обрабатываемая) ошибка.
//          "ИнтеграцияНеИспользуется" - настройка подключения неактивна.
//          "ОперацияВыполнена" - ошибка создания нового заказа на возврат оплаты.
//    * СообщениеОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция ОтменитьДинамическуюСсылку(ДокументОперации) Экспорт

	// Проверка входных параметров
	ИмяФункции = "ПлатежныеСистемы.ОтменитьДинамическуюСсылку";
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ДокументОперации",
		ДокументОперации,
		Метаданные.ОпределяемыеТипы.ДокументОперацииПлатежнойСистемы.Тип);
	
	Возврат ПлатежныеСистемыСлужебный.ОтменитьДинамическуюСсылку(ДокументОперации);

КонецФункции

#КонецОбласти

#Область Возвраты

// Создает запрос на частичный/полный возврат по ранее созданному заказу на оплату.
//
// Параметры:
//  ДокументВозврата - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает возврат в
//    информационной базе.
//  ДокументОплаты - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает оплату в
//    информационной базе.
//                 - Строка - для платежной системы Яндекс Пэй допускается в данном параметре указать
//                    строковый идентификатор операции оплаты, по которой выполняется возврат.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к сервису.
//  ДополнительныеПараметры - Структура, Неопределено - дополнительные настройки формирования запроса на возврат оплаты.
//
// Возвращаемое значение:
//  Структура - результат создания запроса на возврат оплаты в платежной системе:
//    * КодОшибки - Строка - строковый код возникшей ошибки.
//        Возможные значения:
//          "" - возврат оплаты успешно создан.
//          "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения.
//          "НеверныйЛогинИлиПароль" - неверный логин или пароль или параметры подключения к платежной системе.
//          "ОтсутствуетДоступКСервису" - недостаточно прав для выполнения запроса.
//          "ПревышеноКоличествоПопыток" - превышено количество попыток обращения к сервису с некорректным логином и
//            паролем.
//          "СервисВременноНеДоступен" - сервер временно не имеет возможности обрабатывать запросы.
//          "ОшибкаСервиса" - внутренняя ошибка сервиса.
//          "ОшибкаПодключения" - ошибка работы сети Интернет.
//          "НеизвестнаяОшибка" - при получении информации возникла неизвестная (не обрабатываемая) ошибка.
//          "ИнтеграцияНеИспользуется" - настройка подключения неактивна.
//          "ОперацияВыполнена" - ошибка создания нового заказа на возврат оплаты.
//    * СообщениеОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//    * СтатусОперации - Строка - текущее состояние операции оплаты.
//        Возможные значения:
//          см. НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполняется - подтверждение операции не получено.
//          см. НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполнена - платежная система подтвердила операцию.
//          см. НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОтменена - операция не может быть выполнена.
//          см. НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОшибка - не удалось получить статус операции из-за
//            ошибки.
//    * ПараметрыОперации - Структура - дополнительные данные по оплате:
//        ** ИдентификаторОперации - Строка - идентификатор операции в платежной системе.
//        ** ИдентификаторОплаты - Строка - идентификатор оплаты в платежной системе.
//        ** ТипОперации - Строка - тип операции в платежной системе.
//             Возможные значения:
//               см. ПлатежныеСистемыКлиентСервер.ТипОперацииОплата - идентификатор операции оплаты.
//               см. ПлатежныеСистемыКлиентСервер.ТипОперацииВозврат - идентификатор операции возврата.
//        ** ДатаОперации - Дата - фактическая дата оплаты в UTC.
//        ** СуммаОперации - Число - фактическая сумма операции.
//
Функция ВозвратОплаты(
		ДокументВозврата,
		ДокументОплаты,
		НастройкаПодключения,
		ДополнительныеПараметры = Неопределено) Экспорт
	
	// Проверка входных параметров
	ИмяФункции = "ПлатежныеСистемы.ВозвратОплаты";
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ДокументВозврата",
		ДокументВозврата,
		Метаданные.ОпределяемыеТипы.ДокументОперацииПлатежнойСистемы.Тип);
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"НастройкаПодключения",
		НастройкаПодключения,
		Тип("СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам"));
	Если ДополнительныеПараметры <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
			ИмяФункции,
			"ДополнительныеПараметры",
			ДополнительныеПараметры,
			Новый ОписаниеТипов("Структура"));
	КонецЕсли;
	
	// Проверка типа ДокументОплаты в ПлатежныеСистемыСобытия, поскольку для некоторых
	// платежных систем допускается передача строкового идентификатора, а для других только
	// ссылки определенного типа.
	
	Возврат ПлатежныеСистемыСлужебный.ВозвратОплаты(
		ДокументВозврата,
		ДокументОплаты,
		НастройкаПодключения,
		ДополнительныеПараметры);
	
КонецФункции

#КонецОбласти

#Область Статусы

// Выполняет получение статуса операции в платежной системе.
// Если терминальный статус операции был загружен ранее, то метод вернет информацию из базы данных, в противном случае
// будет выполнен запрос к сервису платежной системы.
// 
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает операцию в
//    информационной базе.
//  ВремяОжидания - Число - время ожидания терминального статуса в секундах.
//    Если параметр заполнен, то получение статуса будет выполняться в цикле с незначительными задержками
//    между запросами. Если Значение = 0, то поведение зависит от параметра ДлительнаяОперация.
//  ДлительнаяОперация - Булево - анализируется только при Значение = 0:
//    если Ложь, то операция будет выполнена только 1 раз;
//    если Истина, то длительность будет определятся общими настройками платежных систем.
//
// Возвращаемое значение:
//  Структура - результат получения статуса операции:
//    * КодОшибки - Строка - строковый код возникшей ошибки.
//        Возможные значения:
//          "" - операция получения статуса операции выполнено успешно.
//          "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения.
//          "НеверныйЛогинИлиПароль" - неверный логин или пароль или параметры подключения к платежной системе.
//          "ОтсутствуетДоступКСервису" - недостаточно прав для выполнения запроса.
//          "ОбъектНеНайден" - искомый объект в сервисе не найден.
//          "ПревышеноКоличествоПопыток" - превышено количество попыток обращения к сервису с некорректным логином и
//            паролем.
//          "СервисВременноНеДоступен" - сервер временно не имеет возможности обрабатывать запросы.
//          "ОшибкаСервиса" - внутренняя ошибка сервиса.
//          "ОшибкаПодключения" - ошибка работы сети Интернет.
//          "НеизвестнаяОшибка" - при получении информации возникла неизвестная (не обрабатываемая) ошибка.
//          "ИнтеграцияНеИспользуется" - настройка подключения неактивна.
//    * СообщениеОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//    * СтатусОперации - Строка - текущее состояние операции оплаты.
//        Возможные значения:
//          см. НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполняется - подтверждение операции не получено.
//          см. НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполнена - платежная система подтвердила операцию.
//          см. НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОтменена - операция не может быть выполнена.
//          см. НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОшибка - не удалось получить статус операции из-за
//            ошибки.
//    * ПараметрыОперации - Структура - дополнительные данные по операции:
//        ** ИдентификаторОперации - Строка - идентификатор операции в платежной системе.
//        ** ИдентификаторОплаты - Строка - идентификатор оплаты в платежной системе.
//        ** ТипОперации - Строка - тип операции в платежной системе.
//             Возможные значения:
//               см. ПлатежныеСистемыКлиентСервер.ТипОперацииОплата - идентификатор операции оплаты.
//               см. ПлатежныеСистемыКлиентСервер.ТипОперацииВозврат - идентификатор операции возврата.
//        ** ДатаОперации - Дата - фактическая дата оплаты в UTC.
//        ** СуммаОперации - Число - фактическая сумма операции.
//
Функция СтатусОперации(ДокументОперации, ВремяОжидания = 0, ДлительнаяОперация = Ложь) Экспорт
	
	// Проверка входных параметров
	ИмяФункции = "ПлатежныеСистемы.СтатусОперации";
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ДокументОперации",
		ДокументОперации,
		Метаданные.ОпределяемыеТипы.ДокументОперацииПлатежнойСистемы.Тип);
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ВремяОжидания",
		ВремяОжидания,
		Тип("Число"));
	
	Возврат ПлатежныеСистемыСлужебный.СтатусОперации(
		ДокументОперации,
		ВремяОжидания,
		,
		ДлительнаяОперация);
	
КонецФункции

// Выполняет установку признака загрузки статуса регламентным заданием, если
// ранее под документу была сгенерирован идентификатор оплаты. Установка
// признака доступна только для сформированных операций у которых текущий статус
// "Выполняется".
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает
//    операцию оплаты или возврата в информационной базе;
//  Значение - Булево - если Истина, данные статуса будут загружены регламентным заданием.
//
// Возвращаемое значение:
//  Булево - Истина, если признак отложенной загрузки статуса установлен,
//   Ложь если операция не найдена.
//
Функция УстановитьОтложенноеПолучениеСтатуса(ДокументОперации, Значение) Экспорт
	
	// Проверка входных параметров
	ИмяФункции = "ПлатежныеСистемы.УстановитьОтложенноеПолучениеСтатуса";
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ДокументОперации",
		ДокументОперации,
		Метаданные.ОпределяемыеТипы.ДокументОперацииПлатежнойСистемы.Тип);
	
	ПлатежныеСистемыСлужебный.ПроверитьПраваНаВыполнениеОперации();
	
	Возврат РегистрыСведений.ИдентификаторыПлатежныхСистем.УстановитьОтложенноеПолучениеСтатуса(
		ДокументОперации,
		Значение);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ДополнительныеОперации

// Возвращает данные операции по документу.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает операцию в
//    информационной базе.
//
// Возвращаемое значение:
//  Неопределено, Структура - данные операции; Неопределено, если данные операции по документу не найдены:
//    * Идентификатор - Строка - внутренний идентификатор операции.
//    * ИдентификаторОперации - Строка - идентификатор операции в платежной системе.
//    * ИдентификаторОплаты - Строка - идентификатор оплаты в платежной системе.
//    * ТипОперации - Строка - тип выполненной операции в платежной системе.
//        Возможные значения:
//          см. ПлатежныеСистемыКлиентСервер.ТипОперацииОплата - операция оплаты.
//          см. ПлатежныеСистемыКлиентСервер.ТипОперацииВозврат - операция возврата оплаты.
//    * СтатусОперации - Строка - текущее состояние операции оплаты.
//        Возможные значения:
//          см. НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполняется - операция в процессе выполнения.
//          см. НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполнена - платежная система выполнила операцию.
//          см. НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОтменена - операция отменена в платежной системе.
//          см. НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОшибка - выполнение операции завершилось ошибкой в
//            платежной системе.
//    * ДатаОперации - Дата - фактическая дата операции в UTC.
//    * ДатаЗапросаСтатуса - Дата - дата последнего запроса статуса операции.
//    * СуммаОперации - Число - фактическая суммы операции по документу.
//    * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к
//        сервису.
//    * ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - платежная система, через которую выполнена операция.
//    * СпособОплаты - Строка - способ оплаты. Доступные значения определяются методами
//        общего модуля ПлатежныеСистемыКлиентСервер.
//    * КассоваяСсылка - Строка - идентификатор (ключ) кассовой ссылки.
//    * ПлатежнаяСсылка - Строка - адрес страницы по которой выполняется оплата.
//    * ДатаДействияСсылки - Дата - дата действия платежной ссылки в UTC.
//
Функция ДанныеОперации(ДокументОперации) Экспорт
	
	// Проверка входных параметров
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"ПлатежныеСистемы.",
		"ДокументОперации",
		ДокументОперации,
		Метаданные.ОпределяемыеТипы.ДокументОперацииПлатежнойСистемы.Тип);
	
	ДанныеРегистра = РегистрыСведений.ИдентификаторыПлатежныхСистем.ДанныеОперации(ДокументОперации);
	Если ДанныеРегистра = Неопределено Тогда
		Результат = Неопределено;
	Иначе
		
		Результат = Новый Структура();
		Результат.Вставить("Идентификатор", ДанныеРегистра.Идентификатор);
		Результат.Вставить("ИдентификаторОперации", ДанныеРегистра.ИдентификаторОперации);
		Результат.Вставить("ИдентификаторОплаты", ДанныеРегистра.ИдентификаторОплаты);
		Результат.Вставить("СтатусОперации", ДанныеРегистра.СтатусОперации);
		Результат.Вставить("ДатаОперации", ДанныеРегистра.ДатаОперации);
		Результат.Вставить("СуммаОперации", ДанныеРегистра.СуммаОперации);
		Результат.Вставить("НастройкаПодключения", ДанныеРегистра.НастройкаПодключения);
		Результат.Вставить("ПлатежнаяСистема", ДанныеРегистра.ПлатежнаяСистема);
		Результат.Вставить("СпособОплаты", ДанныеРегистра.СпособОплаты);
		Результат.Вставить("КассоваяСсылка", ДанныеРегистра.КассоваяСсылка);
		Результат.Вставить("ПлатежнаяСсылка", ДанныеРегистра.ПлатежнаяСсылка);
		Результат.Вставить("ДатаДействияСсылки", ДанныеРегистра.ДатаДействияСсылки);
		Результат.Вставить("ДатаЗапросаСтатуса", ДанныеРегистра.ДатаЗапросаСтатуса);
		
		Если ДанныеРегистра.Оплата Тогда
			Результат.Вставить("ТипОперации", ПлатежныеСистемыКлиентСервер.ТипОперацииОплата());
		Иначе
			Результат.Вставить("ТипОперации", ПлатежныеСистемыКлиентСервер.ТипОперацииВозврат());
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Удаляет данные операции из информационной базы.
// Процедуру необходимо использовать только в том случае, если при вызове методов оплаты в качестве документа оплаты
// была передана ссылка нового и после выполнения оплаты объект не был записан. Во всех остальных случаях вызов метода
// не рекомендуется.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает операцию в
//    информационной базе.
//
Процедура УдалитьОперацию(ДокументОперации) Экспорт
	
	// Проверка входных параметров
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"ПлатежныеСистемы.УдалитьОперацию",
		"ДокументОперации",
		ДокументОперации,
		Метаданные.ОпределяемыеТипы.ДокументОперацииПлатежнойСистемы.Тип);
	
	ПлатежныеСистемыСлужебный.ПроверитьПраваНаВыполнениеОперации();
	
	РегистрыСведений.ИдентификаторыПлатежныхСистем.УдалитьОперацию(ДокументОперации);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
